# HardwoodTintEnabled Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Hardwood..::..HardwoodTintEnabled Property
Hardwood Class See Also
---
The property labeled "Stain" from the "Hardwood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string HardwoodTintEnabled { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property HardwoodTintEnabled As String
	Get
```

Visual C++
---
```text
public:
static property String^ HardwoodTintEnabled {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "HardwoodTintEnabledType".
# See Also
Hardwood Class
Autodesk.Revit.DB.Visual Namespace